In [45]:
import pandas as pd

In [87]:
df = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")
pass_id = test["PassengerId"]

In [47]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [48]:
df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [49]:
test.isnull().any()

PassengerId    False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
dtype: bool

In [50]:
def clean(data):
    data = data.drop(["Name","Ticket","Cabin"],axis =1)
    
    cols = ["Age","Fare"]
    
    for i in cols:
        data[i].fillna(data[i].median(),inplace=True)
        
    data["Embarked"].fillna("U",inplace=True)
    
    return data
df = clean(df)
test = clean(test)

In [51]:
df.isnull().values.any()

False

In [52]:
test.isnull().values.any()

False

In [53]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [54]:
test.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [61]:
from sklearn.preprocessing import LabelEncoder
lbe = LabelEncoder()

columns = ["Sex","Embarked"]

for column in columns:
    test[column] = lbe.fit_transform(test[column])
    df[column] = lbe.fit_transform(df[column])
    
    
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

In [76]:
from sklearn.linear_model import LogisticRegression

In [77]:
from sklearn.model_selection import train_test_split,cross_val_score,cross_val_predict

In [78]:
Y = df["Survived"]
X = df.drop(['Survived'],axis = 1)
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,random_state=42,test_size=0.3)

In [82]:
log_model = LogisticRegression(max_iter = 2000).fit(X_train,Y_train)

In [83]:
pred = log_model.predict(X_test)

In [84]:
from sklearn.metrics import accuracy_score

In [85]:
accuracy_score(Y_test,pred)

0.8059701492537313

In [86]:
submission_preds = log_model.predict(test)

In [88]:
data_f =pd.DataFrame(
{
    "PassengerId" : pass_id,
    "Survived" : submission_preds
}
)

In [89]:
data_f.to_csv("submission.csv",index = False)